Repository: rickparrish/luci-app-adblock-lean
Catalog: applications/luci-app-adblock-lean/po/*/adblock-lean.po
Languages: es

source: %s is only executed upon completion of the %s command.
es: %s sólo se ejecuta al finalizar el comando %s.

source: Activate Blocklist
es: Activar lista de bloqueo

source: Activating
es: Activando

source: Add new entries:
es: Añade nuevas entradas:

source: Advanced Settings
es: Opciones avanzadas

source: Allowlist
es: Lista de permitidos

source: Allowlist urls
es: Lista de URL permitidas

source: An error occurred while checking update status (checking adblock-lean status)
es: Se ha producido un error al comprobar el estado de actualización (comprobación del estado adblock-lean)

source: An error occurred while checking update status (checking luci-app-adblock-lean status)
es: Se ha producido un error al comprobar el estado de actualización (comprobación del estado de luci-app-adblock-lean)

source: An error occurred while checking update status (missing current version)
es: Se ha producido un error al comprobar el estado de la actualización (falta la versión actual)

source: An error occurred while checking update status (missing package info)
es: Se ha producido un error al comprobar el estado de la actualización (falta información del paquete)

source: An update is available
es: Hay una actualización disponible

source: An update is available, but it uses a newer config format than the LuCI App supports, so you will need to update the LuCI App before you can install the latest adblock-lean
es: Existe una actualización disponible, pero utiliza un formato de configuración más reciente que el que admite la aplicación LuCI, por lo que deberá actualizar la aplicación LuCI antes de poder instalar la última versión de adblock-lean

source: Based on your total memory size of %sMB, the recommended preset of %s has been selected.
es: Basado en su tamaño total de memoria de %sMB, el preajuste recomendado de %s ha sido seleccionado.

source: Blocklist
es: Lista de bloqueo

source: Blocklist is NOT active (paused)
es: La lista de bloqueo NO está activa (en pausa)

source: Blocklist is NOT active (stopped)
es: La lista de bloqueo NO está activa (detenida)

source: Blocklist is active. Good line count: %s. Last updated %d hour(s) ago.
es: Lista de bloqueo activa. Líneas: %s. Última act. hace %d hora(s).

source: Blocklist status
es: Estado de la lista de bloqueo

source: Boot start delay (seconds)
es: Retraso de inicio desde el arranque (segundos)

source: Call custom resport_success() and report_failure() functions when certain commands complete.<br />See <b>Custom Script</b> tab for more details.
es: Llama a las funciones personalizadas report_success() y report_failure() cuando se completen ciertos comandos.<br />Consulta la pestaña <b>Script Personalizado</b> para más detalles.

source: Check the status panel above to see whether there are updates for one (or both) packages, and update as necessary.
es: Compruebe el panel de estado anterior para ver si hay actualizaciones para uno (o ambos) paquetes, y actualice según sea necesario.

source: Click the Update button below the make the following automatic changes:
es: Haga clic en el botón Actualizar para realizar los siguientes cambios automáticos:

source: Compress final blocklist, intermediate blocklist parts and the backup blocklist to save memory
es: Comprime la lista de bloqueo final, las partes intermedias de la lista de bloqueo y la lista de bloqueo de reserva para ahorrar memoria

source: Config modifications have been saved, reload adblock-lean for changes to take effect.
es: Las modificaciones de configuración han sido guardadas, recarga adblock-lean para que los cambios surtan efecto.

source: Custom Script
es: Script personalizado

source: Deactivate Blocklist
es: Desactivar lista de bloqueo

source: Deactivating
es: Desactivando

source: Deduplication
es: Deduplicación

source: Disable Service
es: Deshabilitar servicio

source: Disabling
es: Desactivando

source: ERROR: Test domain lookup failed
es: ERROR: Falló la consulta de dominio de prueba

source: ERROR: Test domain resolved to 0.0.0.0
es: ERROR: El dominio de prueba resolvió a 0.0.0.0

source: Either way, you should now <a %s>manually create a config file following the instructions here</a>.
es: De cualquier manera, ahora debe <a %s>crear manualmente un archivo de configuración siguiendo las instrucciones aquí</a>.

source: Enable Service
es: Habilitar servicio

source: Enable custom script
es: Habilitar script personalizado

source: Enabling
es: Activando

source: Error checking blocklist status, try again in a minute
es: Error al comprobar el estado de la lista de bloqueo, intenta de nuevo en un minuto

source: General Settings
es: Ajustes generales

source: Grant access to LuCI app adblock-lean
es: Conceder acceso a la aplicación LuCI adblock-lean

source: Hagezi blocklists
es: Listas de bloqueo de Hagezi

source: If you installed adblock-lean via this app, a config file should have been created for you, which means something went wrong and you should <a %s>create an Issue here</a>.
es: Si ha instalado adblock-lean a través de esta aplicación, se debería haber creado un archivo de configuración para usted, lo que significa que algo ha ido mal y debería <a %s>crear una incidencia aquí</a>.

source: In most cases you should make configuration changes via the %s page, but if for some reason you want to view/edit the raw config file, you can do so here.
es: En la mayoría de los casos deberías hacer cambios en la configuración a través de la página %s, pero si por alguna razón quieres ver/editar el archivo de configuración en bruto, puedes hacerlo aquí.

source: Install adblock-lean
es: Instalar adblock-lean

source: Installing adblock-lean
es: Instalación de adblock-lean

source: Large
es: Grande

source: Large-Relaxed
es: Grande-Relajado

source: List part failed action
es: Acción al fallar la parte de la lista

source: LuCI App update status
es: Estado de actualización de la aplicación LuCI

source: Max download retries
es: Reintentos máx. de descarga

source: Max file size (KB)
es: Tamaño máx. de archivo (KB)

source: Max total size (KB)
es: Tamaño total máx. (KB)

source: Maximum number of download retries
es: Número máximo de reintentos de descarga

source: Maximum size of any individual downloaded blocklist part
es: Tamaño máximo de cualquier parte descargada individualmente de la lista de bloqueo

source: Maximum total size of combined, processed blocklist
es: Tamaño total máximo de la lista de bloqueo combinada y procesada

source: Medium
es: Medio

source: Min allowlist part line count
es: Número mín. de líneas permitidas

source: Min blocklist part line count
es: Número mín. de líneas de bloqueo

source: Min good lines
es: Líneas mín. buenas

source: Minimum number of good lines in final postprocessed blocklist
es: Número mínimo de líneas buenas en la lista de bloqueo final postprocesada

source: Mininum number of lines of any individual downloaded part
es: Número mínimo de líneas de cualquier parte descargada individualmente

source: Must select or provide at least one blocklist
es: Debe seleccionar o proporcionar al menos una lista de bloqueo

source: NOTE: adblock-lean will continue to function as expected while this incompatability exists, the only functionality you are missing out on is the configuration form.
es: NOTA: adblock-lean continuará funcionando como se espera mientras exista esta incompatibilidad, la única funcionalidad que está perdiendo es el formulario de configuración.

source: Once you've created a config file, please reload this page.
es: Una vez que haya creado un archivo de configuración, vuelva a cargar esta página.

source: Or to fix it manually, SSH into your router and try executing %s
es: O para solucionarlo manualmente, SSH en el router y tratar de ejecutar %s

source: Or, if you'd like to manually update your config file, these are the changes that are needed:
es: O, si desea actualizar manualmente su archivo de configuración, estos son los cambios necesarios:

source: Other blocklist urls
es: Otras URLs de listas de bloqueo

source: Overview
es: Visión general

source: Pause Blocklist
es: Pausar lista de bloqueo

source: Pausing
es: En pausa

source: Please note
es: Tenga en cuenta

source: Reload Blocklist
es: Recargar lista de bloqueo

source: Reloading
es: Recargar

source: Remove old entries:
es: Eliminar entradas antiguas:

source: Reset Config File
es: Restablecer archivo de configuración

source: Resetting adblock-lean config file
es: Restablecimiento del archivo de configuración adblock-lean

source: Restart dnsmasq
es: Reiniciar dnsmasq

source: Restart dnsmasq if previous blocklist was extracted and before generation of new blocklist thereby to free up memory during generaiton of new blocklist
es: Reiniciar dnsmasq si la lista de bloqueo anterior fue extraída y antes de generar una nueva lista de bloqueo para liberar memoria durante la generación de la nueva lista

source: Resume Blocklist
es: Reanudar lista de bloqueo

source: Resuming
es: Reanudar

source: Select one of the pre-defined blocklist presets, each one intended for devices with a certain total memory capacity.
es: Selecciona uno de los preajustes predefinidos de la lista de bloqueos, cada uno destinado a dispositivos con una determinada capacidad total de memoria.

source: Select the package(s) you would also like to install to make list processing significantly faster (doesn't affect DNS resolution speed). gawk (including dependencies) may consume around 1MB, so consider unselecting gawk if flash space is an issue.
es: Seleccione el paquete o paquetes que también desea instalar para que el procesamiento de listas sea significativamente más rápido (no afecta a la velocidad de resolución de DNS). gawk (incluidas las dependencias) puede consumir alrededor de 1 MB, así que considere deseleccionar gawk si el espacio flash es un problema.

source: Service status
es: Estado del servicio

source: Small
es: Pequeño

source: Start delay in seconds when service is started from system boot
es: Retraso en segundos cuando el servicio se inicia desde el arranque del sistema

source: The currently installed versions of adblock-lean and luci-app-adblock-lean are not compatable with each other (they do not support the same config format).
es: Las versiones actualmente instaladas de adblock-lean y luci-app-adblock-lean no son compatibles entre sí (no soportan el mismo formato de configuración).

source: This is the adblock-lean config file, stored at %s
es: Este es el archivo de configuración adblock-lean, almacenado en %s

source: This is the adblock-lean custom script, stored at %s
es: Este es el script personalizado adblock-lean, almacenado en %s

source: This is useful if the blocklist urls you subscribe to block something you need -- rather than having to manually pause/resume adblock-lean when you need to access the domain(s), or having to switch to a more permissive blocklist, you can just list the domain(s) here to ensure they don't get blocked.
es: Esto es útil si las urls de la lista de bloqueo a la que está suscrito bloquean algo que usted necesita -- en lugar de tener que pausar/reanudar adblock-lean manualmente cuando necesite acceder al dominio(s), o tener que cambiar a una lista de bloqueo más permisiva, puede simplemente listar el dominio(s) aquí para asegurarse de que no se bloquean.

source: This is useful if the blocklist urls you subscribe to miss something you want to block -- rather than having to switch to a more restrictive blocklist, you can just list the domain(s) here to ensure they get blocked.
es: Esto es útil si las urls de la lista de bloqueo a la que está suscrito omiten algo que desea bloquear: en lugar de tener que cambiar a una lista de bloqueo más restrictiva, puede enumerar aquí los dominios para asegurarse de que se bloquean.

source: This is your local adblock-lean allowlist, stored at %s
es: Esta es su lista local de permisos adblock-lean, almacenada en %s

source: This is your local adblock-lean blocklist, stored at %s
es: Esta es su lista de bloqueo local adblock-lean, almacenada en %s

source: This option applies to blocklist/allowlist parts which failed to download or couldn't pass validation checks<br /> SKIP - skip failed blocklist file part and continue blocklist generation<br /> STOP - stop blocklist generation (and fall back to previous blocklist if available)
es: Esta opción se aplica a las partes de la lista de bloqueo/lista permitida que no se han podido descargar o que no han podido pasar las comprobaciones de validación<br /> SKIP - omite la parte del archivo de lista de bloqueo que ha fallado y continúa con la generación de la lista de bloqueo<br /> STOP - detiene la generación de la lista de bloqueo (y vuelve a la lista de bloqueo anterior si está disponible).

source: This script should define the functions %s and %s, and one of these functions will be executed when adblock-lean completes the execution of some commands with the success or failure message passed in first argument.
es: Este script debe definir las funciones %s y %s, y una de estas funciones será ejecutada cuando adblock-lean complete la ejecución de algunos comandos con el mensaje de éxito o fracaso pasado como primer argumento.

source: To automatically reset it now, click the Reset button below.
es: Para restablecerlo automáticamente ahora, haga clic en el botón Restablecer que aparece a continuación.

source: To install it now review and submit the form below, or <a %s>to install it manually follow the instructions here</a>.
es: Para instalarlo ahora revisa y envía el siguiente formulario, o <a %s>para instalarlo manualmente sigue las instrucciones aquí</a>.

source: Unable to save changes: %s
es: No se pueden guardar los cambios: %s

source: Unable to save modifications: %s
es: No se pueden guardar las modificaciones: %s

source: Unknown
es: Desconocido

source: Up to date
es: Actualizado

source: Update Config File
es: Actualizar archivo de configuración

source: Update LuCI App
es: Actualizar aplicación LuCI

source: Update adblock-lean
es: Actualizar adblock-lean

source: Updating LuCI app...
es: Actualizando aplicación LuCI...

source: Updating adblock-lean config file
es: Actualizando archivo de configuración adblock-lean

source: Updating adblock-lean...
es: Actualizando adblock-lean...

source: Use compression
es: Usar compresión

source: Whether to perform sorting and deduplication of entries (usually doesn't cause much slowdown, uses a bit more memory)
es: Si se va a realizar la ordenación y deduplicación de las entradas (normalmente no se hace causa mucha ralentización, utiliza un poco más de memoria)

source: Wrap values in double-quotes and/or remove inline comments:
es: Envuelva los valores entre comillas dobles y/o elimine los comentarios en línea:

source: Your adblock-lean configuration file does not exist. Click <strong>Services -> adblock-lean</strong> to configure adblock-lean now.
es: Su archivo de configuración adblock-lean no existe. Haga clic en <strong>Servicios -> adblock-lean</strong> para configurar adblock-lean ahora.

source: Your changes have been saved. Reload adblock-lean for changes to take effect.
es: Tus cambios se han guardado. Vuelva a cargar adblock-lean para que se apliquen los cambios surtan efecto.

source: adblock-lean config error
es: error de configuración adblock-lean

source: adblock-lean config missing
es: Falta la configuración adblock-lean

source: adblock-lean config update needed
es: adblock-lean config actualización necesaria

source: adblock-lean configuration options. For further information please check the <a style="font-weight: bold;" href="https://github.com/lynxthecat/adblock-lean/blob/master/README.md" target="_blank" rel="noreferrer noopener">online documentation</a>
es: adblock-lean opciones de configuración. Para más información, consulte la página <a style="font-weight: bold;" href="https://github.com/lynxthecat/adblock-lean/blob/master/README.md" target="_blank" rel="noreferrer noopener">documentación en línea</a>

source: adblock-lean is installed but the config file is missing.
es: adblock-lean está instalado pero falta el archivo de configuración.

source: adblock-lean is not installed
es: adblock-lean no está instalado

source: adblock-lean is performing an action: %s
es: adblock-lean está realizando una acción: %s

source: adblock-lean software update needed
es: se necesita actualización del software adblock-lean

source: adblock-lean update status
es: adblock-lean estado de actualización

source: adblock-lean will NOT autostart on boot
es: adblock-lean NO se autoiniciará al arrancar

source: adblock-lean will autostart on boot
es: adblock-lean se autoiniciará al arrancar

source: adblock-lean's config file has an error.
es: El archivo config de adblock-lean tiene un error.

source: adblock-lean's config format has changed.
es: El formato de configuración de adblock-lean ha cambiado.

source: add exactly one domain name per line.
es: añada exactamente un nombre de dominio por línea.

source: dnsmasq allowlist urls
es: urls de listas de permitidos dnsmasq

source: dnsmasq blocklist urls
es: urls de listas de bloqueo dnsmasq

source: dnsmasq blocklists provided by hagezi. For blocklist information, please check the <a style="font-weight: bold;" href="https://github.com/hagezi/dns-blocklists/blob/main/README.md" target="_blank" rel="noreferrer noopener">online documentation</a>
es: listas de bloqueo de dnsmasq proporcionadas por hagezi. Para obtener información sobre las listas de bloqueo, por favor consulta la <a style="font-weight: bold;" href="https://github.com/hagezi/dns-blocklists/blob/main/README.md" target="_blank" rel="noreferrer noopener">documentación en línea</a>

source: dnsmasq is NOT running
es: dnsmasq NO está en ejecución

source: dnsmasq is running
es: dnsmasq está en ejecución

source: dnsmasq status
es: estado de dnsmasq

source: for devices with 1024MB of RAM or more. This preset includes circa 1M entries and same default blocklist URLs as %s but the max values are more relaxed and allow for larger fluctuations in downloaded blocklist sizes
es: para dispositivos con 1024 MB de RAM o más. Este preajuste incluye alrededor de 1M de entradas y las mismas URLs de listas de bloqueo por defecto que %s, pero los valores máximos son más relajados y permiten mayores fluctuaciones en los tamaños de las listas de bloqueo descargadas

source: for devices with 128MB of RAM. Aim for <300k entries. This preset includes circa 250k entries
es: para dispositivos con 128 MB de RAM. El objetivo es <300.000 entradas. Este preajuste incluye alrededor de 250.000 entradas

source: for devices with 256MB of RAM. Aim for <600k entries. This preset includes circa 450k entries
es: para dispositivos con 256 MB de RAM. El objetivo es <600k entradas. Este preajuste incluye alrededor de 450k entradas

source: for devices with 512MB of RAM. This preset includes circa 1M entries
es: para dispositivos con 512 MB de RAM. Este preajuste incluye alrededor de 1M entradas

source: for devices with 64MB of RAM. Aim for <100k entries. This preset includes circa 85k entries
es: para dispositivos con 64 MB de RAM. El objetivo es <100.000 entradas. Este preajuste incluye unas 85.000 entradas

source: you should not modify %s or %s as the Allowlist and Blocklist tabs will only work with the default paths.
es: no debe modificar %s o %s ya que las pestañas Allowlist y Blocklist sólo funcionarán con las rutas por defecto.
